In [484]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pandas_datareader as data

In [497]:
start = '2000-01-01'
end = '2022-11-01'

df = data.DataReader('TSLA','yahoo',start,end)
df.head()

                High       Low      Open     Close       Volume  Adj Close
Date
2010-06-29  1.666667  1.169333  1.266667  1.592667  281494500.0   1.592667
2010-06-30  2.028000  1.553333  1.719333  1.588667  257806500.0   1.588667
2010-07-01  1.728000  1.351333  1.666667  1.464000  123282000.0   1.464000
2010-07-02  1.540000  1.247333  1.533333  1.280000   77097000.0   1.280000
2010-07-06  1.333333  1.055333  1.333333  1.074000  103003500.0   1.074000

In [498]:
df.tail()

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2022-10-26,230.600006,218.199997,219.399994,224.639999,85012500.0,224.639999
2022-10-27,233.809998,222.850006,229.770004,225.089996,61638800.0,225.089996
2022-10-28,228.860001,216.350006,225.399994,228.520004,69152400.0,228.520004
2022-10-31,229.850006,221.940002,226.190002,227.539993,61554300.0,227.539993
2022-11-01,237.399994,227.279999,234.050003,227.820007,62688800.0,227.820007

In [499]:
df=df.reset_index()
df.head()

        Date      High       Low      Open     Close       Volume  Adj Close
0 2010-06-29  1.666667  1.169333  1.266667  1.592667  281494500.0   1.592667
1 2010-06-30  2.028000  1.553333  1.719333  1.588667  257806500.0   1.588667
2 2010-07-01  1.728000  1.351333  1.666667  1.464000  123282000.0   1.464000
3 2010-07-02  1.540000  1.247333  1.533333  1.280000   77097000.0   1.280000
4 2010-07-06  1.333333  1.055333  1.333333  1.074000  103003500.0   1.074000

In [500]:
df.rename(columns = {"Date" : "date", "Open" : "open", "High" : "high", "Low" : "low","Close" : "close", "Volume" : "volume", "Adj Close" : "adj close"}, inplace = True)
#renaming the data frame columns to lower case

In [501]:
df.columns

Index(['date', 'high', 'low', 'open', 'close', 'volume', 'adj close'], dtype='object')

In [377]:
df = df.drop(['date','adj close'], axis =1)

In [502]:
df.head()

        date      high       low      open     close       volume  adj close
0 2010-06-29  1.666667  1.169333  1.266667  1.592667  281494500.0   1.592667
1 2010-06-30  2.028000  1.553333  1.719333  1.588667  257806500.0   1.588667
2 2010-07-01  1.728000  1.351333  1.666667  1.464000  123282000.0   1.464000
3 2010-07-02  1.540000  1.247333  1.533333  1.280000   77097000.0   1.280000
4 2010-07-06  1.333333  1.055333  1.333333  1.074000  103003500.0   1.074000

In [503]:
df.shape

(3109, 7)

In [504]:
data_training = pd.DataFrame(df['close'][0:int(len(df)*0.80)])
data_testing = pd.DataFrame(df['close'][int(len(df)*0.80): int(len(df))])

In [505]:
print(data_training.shape)
print(data_testing.shape)

(2487, 1)
(622, 1)

In [382]:
data_training.head()

      close
0  1.592667
1  1.588667
2  1.464000
3  1.280000
4  1.074000

In [383]:
data_testing.head()

          close
2487  53.278000
2488  54.242001
2489  53.867332
2490  54.370667
2491  55.173332

In [384]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler(feature_range=(0,1))

In [385]:
data_training_array = scaler.fit_transform(data_training)

In [462]:
data_testing.shape

(622, 1)

In [443]:
data_training_array.shape

(2487, 1)